loadgen_encrypt_20180927/loadTestVIP_encrypt_transferableAcc_re01.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="transferableAcc Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <longProp name="ThreadGroup.start_time">1484119421000</longProp>
        <longProp name="ThreadGroup.end_time">1484119421000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">2000</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <doubleProp>
            <name>throughput</name>
            <value>180.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
          <intProp name="calcMode">4</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/data/loadgen_encrypt_20180927/datapool/6000_3.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">os,deviceModel,userId,citizenId,uniqueKey,ack,primaryAccount</stringProp>
        </CSVDataSet>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="mymobackend" elementType="Argument">
              <stringProp name="Argument.name">mymobackend</stringProp>
              <stringProp name="Argument.value">10.211.101.16</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="mymoport" elementType="Argument">
              <stringProp name="Argument.name">mymoport</stringProp>
              <stringProp name="Argument.value">80</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="mymoprotocol" elementType="Argument">
              <stringProp name="Argument.name">mymoprotocol</stringProp>
              <stringProp name="Argument.value">http</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="mymoversion" elementType="Argument">
              <stringProp name="Argument.name">mymoversion</stringProp>
              <stringProp name="Argument.value">1.18.0</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="mymolang" elementType="Argument">
              <stringProp name="Argument.name">mymolang</stringProp>
              <stringProp name="Argument.value">th</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
   &quot;req&quot;:{&#xd;
      &quot;app&quot;:&quot;MyMoGSB&quot;,&#xd;
      &quot;header&quot;:{&#xd;
         &quot;appVersion&quot;:&quot;1.15.0&quot;,&#xd;
         &quot;os&quot;:&quot;${os}&quot;,&#xd;
         &quot;latitude&quot;:&quot;&quot;,&#xd;
         &quot;uniqueKey&quot;:&quot;${uniqueKey}&quot;,&#xd;
         &quot;ack&quot;:&quot;${ack}&quot;,&#xd;
         &quot;rootFlag&quot;:&quot;1&quot;,&#xd;
         &quot;version&quot;:&quot;${mymoversion}&quot;,&#xd;
         &quot;checkFlag&quot;:&quot;1&quot;,&#xd;
         &quot;osVersion&quot;:&quot;8.1.0&quot;,&#xd;
         &quot;deviceModel&quot;:&quot;${deviceModel}&quot;,&#xd;
         &quot;pwd&quot;:&quot;111111&quot;,&#xd;
         &quot;lang&quot;:&quot;${mymolang}&quot;,&#xd;
         &quot;user&quot;:&quot;${citizenId}&quot;,&#xd;
         &quot;longitude&quot;:&quot;&quot;&#xd;
      },&#xd;
      &quot;dom&quot;:&quot;MyMo&quot;,&#xd;
      &quot;op&quot;:&quot;login&quot;,&#xd;
      &quot;sid&quot;:&quot;&quot;,&#xd;
      &quot;srv&quot;:&quot;MyMoAuthen&quot;,&#xd;
      &quot;version&quot;:&quot;${mymoversion}&quot;&#xd;
   }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${mymobackend}</stringProp>
          <stringProp name="HTTPSampler.port">${mymoport}</stringProp>
          <stringProp name="HTTPSampler.protocol">${mymoprotocol}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/json</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="sid Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">sid</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$..sid</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="check sid != null" enabled="true">
          <stringProp name="IfController.condition">&quot;${sid}&quot; != &quot;&quot;;</stringProp>
          <boolProp name="IfController.evaluateAll">true</boolProp>
        </IfController>
        <hashTree>
          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
            <boolProp name="LoopController.continue_forever">true</boolProp>
            <intProp name="LoopController.loops">-1</intProp>
          </LoopController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="transferableAccountInquiry" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{&#xd;
   &quot;req&quot;:{&#xd;
      &quot;app&quot;:&quot;MyMoGSB&quot;,&#xd;
      &quot;header&quot;:{&#xd;
         &quot;accountClass&quot;:&quot;D&quot;,&#xd;
         &quot;flagAcctPerm&quot;:&quot;1&quot;,&#xd;
         &quot;flagListTrans&quot;:&quot;1&quot;,&#xd;
         &quot;hasCashOptions&quot;:&quot;0&quot;,&#xd;
         &quot;isGrouped&quot;:&quot;1&quot;,&#xd;
         &quot;lastAccountNo&quot;:&quot;&quot;,&#xd;
         &quot;lang&quot;:&quot;${mymolang}&quot;,&#xd;
         &quot;numberOfRecord&quot;:&quot;&quot;,&#xd;
      },&#xd;
      &quot;dom&quot;:&quot;MyMo&quot;,&#xd;
      &quot;op&quot;:&quot;transferableAccountInquiry&quot;,&#xd;
      &quot;sid&quot;:&quot;${sid}&quot;,&#xd;
      &quot;srv&quot;:&quot;Account&quot;,&#xd;
      &quot;version&quot;:&quot;${mymoversion}&quot;&#xd;
   }&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.domain">${mymobackend}</stringProp>
              <stringProp name="HTTPSampler.port">${mymoport}</stringProp>
              <stringProp name="HTTPSampler.protocol">${mymoprotocol}</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
              <stringProp name="HTTPSampler.path">/json</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
              </ResultCollector>
              <hashTree/>
              <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
              </ResultCollector>
              <hashTree/>
              <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
                <boolProp name="ResultCollector.error_logging">false</boolProp>
              </ResultCollector>
              <hashTree/>
            </hashTree>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="logout" enabled="false">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
   &quot;req&quot;:{&#xd;
      &quot;app&quot;:&quot;MyMoGSB&quot;,&#xd;
      &quot;header&quot;:{&#xd;
         &quot;lang&quot;:&quot;${mymolang}&quot;&#xd;
      },&#xd;
      &quot;dom&quot;:&quot;MyMo&quot;,&#xd;
      &quot;op&quot;:&quot;logout&quot;,&#xd;
      &quot;sid&quot;:&quot;${sid}&quot;,&#xd;
      &quot;srv&quot;:&quot;MyMoAuthen&quot;,&#xd;
      &quot;version&quot;:&quot;${mymoversion}&quot;&#xd;
   }&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${mymobackend}</stringProp>
            <stringProp name="HTTPSampler.port">${mymoport}</stringProp>
            <stringProp name="HTTPSampler.protocol">${mymoprotocol}</stringProp>
            <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
            <stringProp name="HTTPSampler.path">/json</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
            <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>